spec/fixtures/requests/order_service/set_orders_export_status/with_one_client_order_id.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:web="http://api.channeladvisor.com/webservices/" xmlns:ord="http://api.channeladvisor.com/datacontracts/orders"><soap:Header><web:APICredentials><web:DeveloperKey>$$DEVELOPER_KEY$$</web:DeveloperKey><web:Password>$$PASSWORD$$</web:Password></web:APICredentials></soap:Header><soap:Body><web:SetOrdersExportStatus><web:accountID>$$ACCOUNT_ID$$</web:accountID><web:clientOrderIdentifiers><web:string>ABCD1234</web:string></web:clientOrderIdentifiers><web:markAsExported>true</web:markAsExported></web:SetOrdersExportStatus></soap:Body></soap:Envelope>